export const articles = [
  {
    h3: "技術選定理由",
    p: [
      "nodeのみ、ブラウザのみに依存しない技術であること",
      "可能な限りw3c標準に従っていること",
      "結果再利用可能であること"
    ]
  },
  {
    h3: "今後進めていきたいこと",
    p: [
      "増加するAIエンジンとのUIの考察",
      "ローカルファーストアプリケーション",
      "端末に近い部分でのネットワークインフラ技術を追いかけること"
    ]
  },
  {
    h3: "選定の懸念点",
    p: [
        "1. レンダラの依存：2023.11.27現時点、jsx自体はほぼデファクトと判断している。Reactにとっての特別なものではなく、Htmlテンプレートとして考えることができる、という点では、選定技術のライブラリオーナーと意見は一致。",
        "レンダラ自体も多く出ているため、各種フレームワークが隆盛している限りは、jsxも生き残る",
        "今後もしのぎを削ってくれるかどうか...",
        "",
        "2. スケール：ルーティングをファイルパスで自動的に生成するファイルベースルーティングにはかなわない。",
        "これもライブラリ次第である。",
        "3. Htmxの確立：この概念自体は、フロントエンドフレームワークと一対となって受け入れられていくもので間違いないと思っている",
        "ただし、Htmxのコミュニティはふざけているとの噂が絶えないので、1軸として生き残ってくれることを期待する必要がある",
    ]
  },
  {
    h3: "ごあいさつ",
    p: ["高沢です",
"ご覧いただきありがとうございます。",
"ちいさな技術をテーマに、その場の流れに飲み込まれない製造を心掛けているつもりの人間です。",
"若い業界であるため、移り変わり自体は激しいのは確かですが、",
"振り回されずに解決案を提案できたらと思いつつ、ごあいさつといたします。",
]
  },
];
